LEXICON: dict[str, str] = {
    '/start': 'Привет 🤖\n'
              'Я бот школы <b>Que tal Argentina</b>!\n'
              'Я помогу тебе выучить слова которые ты встретил на уроках и выполнить упражнения из домашних заданий.\n'
              'Нажми <b>"Показать меню ⭐"</b> чтобы начать',
    '/guest': 'Я не смог найти вас в списке учеников школы. Если это ошибка или у вас есть другие вопросы - напишите @posobil',
    '/menu': '<b>Выбери курс:</b>\n\n',
    '/help': '<b>Это бот-читалка</b>\n\nДоступные команды:\n\n/beginning - '
             'перейти в начало книги\n/continue - продолжить '
             'чтение\n/bookmarks - посмотреть список закладок\n/help - '
             'справка по работе бота\n\nЧтобы сохранить закладку - '
             'нажмите на кнопку с номером страницы\n\n<b>Приятного чтения!</b>',
    '/trans': 'Вам нужно выбрать верный перевод слова\n'
              'Переведите слово: ',
    '/trans_sh': 'Переведите слово: ',
    'finish': 'Упражнение выполнено ✅\n\n'
              'Кол-во верных ответов: ',
    'edit_bookmarks': '<b>Редактировать закладки</b>',
    'edit_bookmarks_button': '❌ РЕДАКТИРОВАТЬ',
    'del': '❌',
    'cancel': 'ОТМЕНИТЬ',
    'no_bookmarks': 'У вас пока нет ни одной закладки.\n\nЧтобы '
                    'добавить страницу в закладки - во время чтения '
                    'книги нажмите на кнопку с номером этой '
                    'страницы\n\n/continue - продолжить чтение',
    'cancel_text': '/continue - продолжить чтение',
    'choise_weeks': 'Выбери неделю обучения: ',
    'choise_days': 'Выбери день обучения: ',
    'choise_type_task': 'Выбери задание: '
}

LEXICON_MAIN_BUTTON: dict[str, str] = {
    '/menu': 'Показываю меню',
    '/beginning': 'В начало книги',
    '/continue': 'Продолжить чтение',
    '/bookmarks': 'Мои закладки',
    '/help': 'Справка по работе бота'
}